Repository: oscarahalvorsen/masterproject
Catalog: maalfrid/tmx/udir.no.csv-en-nb.deduped.tmx
Source language: en
Languages: nb

source: This kind of insight can also form the basis for a sophisticated and open dialogue, as well as reconciliation across historical differences.
nb: Slik innsikt kan også legge grunnlag for en nyansert og åpen dialog og forsoning på tvers av historiske motsetningsforhold.

source: ‘Children who struggle with playing, may need help to get started.
nb: – Barn som sliter med å komme inn leken, må få hjelp til det.

source: It involves listening and recognizing linguistic units such as words, expressions and concepts, and being able to use them when speaking.
nb: Det innebærer å lytte og gjenkjenne språklige størrelser som lyder, ord, uttrykk og begreper, og å kunne bruke disse i egen tale.

source: elaborate on imperialism and provide examples of de-colonisation
nb: gjøre rede for imperialisme og kolonialisme og gi eksempler på avkolonisering

source: use an atlas, find information from printed thematic maps and digital map services and locate neighbouring municipalities, counties in Norway, the traditional Sami areas and the largest countries in the world on a map
nb: bruke atlas, hente ut informasjon fra papirbaserte temakart og digitale karttjenester, plassere stedsnavn i Sápmi/Sábme/Saepmie på kart og gjøre rede for disse, og plassere nabokommuner, fylkene i Norge og de største landene i verden på kart

source: She believes that children are interested in this issue.
nb: Barns lek kan være komplisert, og noen leker krever erfaring og øvelse.

source: “All children need to feel that they are seen as competent persons and have a role to play,” Zachrisen says.
nb: Alle barn trenger å føle at de blir sett på som kompetente og regnet med av de andre, både barna og de ansatte, mener Zachrisen.

source: read different types of text with an understanding of the content
nb: lese ulike typer tekster med forståelse av innholdet

source: The main subject area of oral communication involves listening and communicating using varying degrees of speech in various settings.
nb: dreier seg om muntlig kommunikasjon, det vil si å lytte og ulike grader av tale, og utforsking av muntlig tekst.

source: Numbers and algebra
nb: Tal og algebra i praksis

source: give an account of how international cooperation can assist in surveillance and early warnings for natural disasters
nb: gjøre rede for hva systematiske rapporter og dokumentasjon innebærer, og gi eksempler på bruk av slik dokumentasjon i ambulansetjenesten

source: recognise, talk about and further develop structures in simple number patterns
nb: gjenkjenne, samtale om og videreføre strukturer i enkle tallmønster

source: All the same, it was surprising how little the outdoor environment in the Odense preschool project explains the differences between the preschools’, continues Olesen.
nb: Likevel er det overraskende hvor lite utemiljøet i Odense barnehageprosjekt forklarer forskjeller mellom barnehager, mener Olesen.

source: ‘One often starts with a hypothesis, then looks for differences.
nb: – Man går ofte ut fra en hypotese, og så leter man etter forskjellene.

source: durability, and possibility for repair and recycling
nb: holdbarhet og muligheter for reparasjon og gjenbruk

source: The pupils shall participate in democratic processes, thus developing their democratic ideals and understanding of the importance of active and committed participation in a multicultural society.
nb: Elevene får delta i demokratiske prosesser og kan slik utvikle demokratisk sinnelag, og forståelse for betydningen av aktiv og engasjert deltakelse i et mangfoldig samfunn.

source: We climb up on the fence and then pull ourselves up onto the roof,’
nb: Vi klatrer opp på gjerdet og drar oss opp på taket,»

source: Operation and maintenance
nb: Drift og vedlikehold

source: talk about Christianity and the Christian way of viewing life and ethics with an emphasis on their idea of god, their view of humanity, current ethical challenges and selected Christian texts
nb: samtale om kristendom, kristen livstolkning og etikk med vekt på gudsbilde, menneskesyn, aktuelle etiske utfordringer og utvalgte kristne tekster

source: Eight children, ranging in age from 1 to 3, had to be dressed to play outside.
nb: Åtte barn i alderen 1 til 3 år må kles på før de skal ut.

source: explain the Buddhist calendar of festivals and describe Buddhist festivals and central rituals
nb: forklare en buddhistisk høytidskalender, og beskrive buddhistiske høytider, ritualer og musikk

source: Sick students and staff members must stay home.
nb: Syke personer skal ikke være på skolen.

source: ‘It is positive that they can use this waiting time for their own, physically close, private time with other children.
nb: – Det positive er at de kan bruke denne ventetiden til sitt eget, fysisk intime, private nærvær med andre barn.

source: In private ECEC facilities, it is more common to be visited by playground inspectors from private companies.
nb: I private barnehager er det mer vanlig at man får besøk av lekeplassinspektører fra private firmaer.

source: To explore may mean to sense, seek, discover, observe and examine.
nb: Å utforske kan bety å sanse, søke, oppdage, observere og granske.

source: write informative texts, reports and discussions with a clear objective, good structure and rational arguments
nb: skrive informative tekster, utgreiinger og drøftinger med klar hensikt, god struktur og saklig argumentasjon

source: use rhetorical concepts to analyse and evaluate texts in different non-fiction genres
nb: bruke begrepsapparat fra retorikken for å analysere og vurdere tekster i ulike sakprosasjangere

source: Information technology - programme subject in programmes for Specialization in General Studies (INF1-01)
nb: Læreplan i informasjonsteknologi - programfag i utdanningsprogram for studiespesialisering (INF1-01)

source: talk about central stories from Hinduism
nb: samtale om sentrale fortellinger i hinduismen

source: At the same time, the programme subject shall make it clear that chemical research is subject to ethical criteria.
nb: Samtidig skal programfaget formidle at det stilles etiske krav til kjemisk forskning.

source: The programme subject Politics, the individual and society shall aid in developing independent individuals who learn to become better citizens through their encounter with the world at large, other cultures and teaching materials.
nb: Programfaget politikk, individ og samfunn skal bidra til å utvikle selvstendige individer som bygger opp sitt medborgerskap i møte med verden, kulturer og lærestoff.

source: explore, describe and compare the properties of two and three
nb: utforske, beskrive og sammenligne egenskaper ved to- og

source: present an overview of the diversity of Islam, important historic events and Islam's position in Norway and the world today
nb: gi en oversikt over viktige historiske hendelser og innhente informasjon om islams stilling i Norge og verden i dag

source: Figure 2.6 shows the difference between boys and girls in average performances in TIMSS Advanced for all the participating countries.
nb: Figur 2.6 viser forskjeller mellom jenter og gutter i gjennomsnittlige prestasjoner i TIMSS Advanced for alle deltakende land.

source: Emphasis is on cooperation with others, ecological understanding and consideration for life.
nb: I dette inngår materialkunnskap, renhold og vedlikehold av materialene.

source: Surveying and discussing change processes are key elements of this subject.
nb: Kartlegging og diskusjon av endringsprosesser står sentralt i hovedområdet.

source: The development of oral skills in Mathematics begins with conversations about mathematics and leads to presenting, discussing and elaborating on more and more complex themes related to the subject matter.
nb: Utviklingen i muntlige ferdigheter i matematikk går fra å delta i samtaler om matematikk til å presentere og drøfte komplekse faglige emner.

source: The ability to carry out investigations with figures and use basic arithmetic based on social science databases and also interpret figures with a critical eye are central themes in the subject.
nb: Evnen til å gjennomføre undersøkelser med telling og regning, bruke samfunnsfaglige databaser og kritisk tolke tallmateriell er sentral.

source: complete a written in-depth project of their own choosing that analyzes a text and present it to an audience
nb: gjennomføre et selvvalgt skriftlig fordypningsarbeid i analyse av tekst og presentere det for et publikum

source: explain what philosophy and ethics are
nb: forklare hva filosofi og etikk er

source: describe and assess international regions beset by conflict and problems
nb: beskrive og vurdere internasjonale konflikt- og problemområder

source: All the same, little is known about how technology is used in kindergarten, or about how children and adults experience the use of technology.
nb: Likevel finnes det lite kunnskap om hvordan teknologi brukes i barnehagene, og hvordan barn og voksne opplever bruken.

source: atomic models and the periodic table to
nb: atommodeller og periodesystemet til å

source: plan, implement, evaluate and document the cleaning and maintenance of boats, engines and equipment in the aquaculture industry
nb: planlegge, gjennomføre, vurdere og dokumentere renhold og vedlikehold av båter, motorer og utstyr i oppdrettsnæringen

source: participate in spontaneous conversations on various themes and relevant topics
nb: bruke relevant og presis terminologi for å beskrive språkets formverk og strukturer

source: explain what a humanistic philosophy of life is, and talk about the humanistic manner of viewing life and ethics with an emphasis on the understanding of reality, their view of humanity, current ethical challenges and selected texts from the humanistic tradition
nb: forklare hva et humanistisk livssyn er og samtale om humanistisk livstolkning og etikk med vekt på virkelighetsforståelse, menneskesyn, utvalgte tekster og aktuelle etiske utfordringer

source: All these strategies are about creating private rooms, close relations and building alliances.
nb: Alle disse strategiene handler om å skape private rom og tette relasjoner og om å bygge allianser.

source: understand, interpret and compare information from a number of forms of expression in a composite text
nb: reflektere rundt og vurdere bruk av tegnspråk i medier og digitale informasjonskanaler

source: In the Law programme subject, basic skills are understood as follows:
nb: I markedsføring og ledelse forstås grunnleggende ferdigheter slik:

source: Interpreting, comparing and applying data and statistics are relevant to working with professional subjects.
nb: Å tolke, sammenligne og anvende tallmateriale og statistikk er relevant i arbeidet med faglige temaer.

source: Politicians, researchers and teachers in kindergarten agree on that.
nb: Det er både politikere, forskere og barnehagelærere enige om.

source: This process requires the use of measurement units and suitable techniques, measuring tools and formulas.
nb: Denne prosessen krever bruk av måleenheter og passende teknikker, måleredskaper og formler.

source: ‘They were also concerned about how discipline was expressed as a value.
nb: – De var også opptatt av hvordan verdien disiplin kom til uttrykk.

source: They also involve using digital tools and programming in creative and innovative processes.
nb: Det innebærer også å bruke digitale verktøy og programmering i kreative og skapende prosesser.

source: geometric and numerical patterns
nb: mønstre og i tallmønstre

source: Many responded that they liked to be in kindergarten, and that kindergarten is a good place for children.
nb: Mange svarte at de likte å være i barnehagen, og at barnehagen er et fint sted for barn.

source: Knowledge of visual and material cultures lays the foundation for making conscious choices as a consumer and fellow citizen, as well as in one's own creative work.
nb: Kunnskap om visuell og materiell kultur gir grunnlag for å ta bevisste valg som forbruker og medborger og i eget skapende arbeid.

source: In this context it is vital to develop the ability to critically assess and use sources.
nb: Det innebærer nye muligheter i tegnspråkopplæringen, i produksjon, komponering og redigering av tegnspråktekster.

source: Åsa Söderström has led the work of collecting the results from a study on bullying in Swedish kindergartens.
nb: Åsa Söderström har ledet ­arbeidet med å samle resultatene fra en kartlegging av mobbing i svenske barnehager.

source: The Norwegian Education Act demands that the teaching of this subject be objective, critical and pluralistic.
nb: Opplæringsloven legger til grunn at undervisningen skal være objektiv, kritisk og pluralistisk.

source: explore how climatic changes affect nature and society locally,
nb: utforske hva endringer i klimaet betyr for natur og samfunn lokalt,

source: For example, play has a strong position in education’, comments the researcher.
nb: Lek er for eksempel sterkt vektlagt i utdanningen, sier forskeren.

source: The welfare state and human rights
nb: velferdsstat og menneskerettigheter

source: Neither was there any significant difference between Norwegian boys and girls in the content domains Algebra, Calculus and Geometry.
nb: Det var heller ingen signifikante forskjeller mellom norske jenter og gutter innen emneområdene Algebra, Kalkulus og Geometri.

source: soft materials in a safe and environmentally friendly way
nb: sammenføye harde, plastiske og myke materialer på en trygg og miljøbevisst måte

source: One kindergarten does not allow paper planes on Mondays.
nb: I én barnehage er det ikke lov med papirfly på mandager.

source: read and use printed and digital maps and pinpoint main geographical characteristics of one's own county, neighbouring counties, Sami settlement areas, Norway, Europe and other regions of the world
nb: lese og bruke papirbaserte og digitale kart og lokalisere geografiske hovedtrekk i eget fylke, nabofylkene, Sápmi/Sábme/Saepmie, Norge, Europa og andre verdensdeler og gjøre rede for samiske stedsnavn

source: We must be able to distinguish between spoken and written styles and informal and formal styles.
nb: Det betyr å utvikle tegn- og/eller ordforråd og ferdigheter i å kunne bruke dem.

source: understand and make use of standard conventions for showing politeness
nb: forstå og bruke vanlige høflighetsformer

source: They may be better at more concrete activities, like playing ball.
nb: De kan være flinke til det konkrete, for eksempel å spille ball.

source: Sonny and Sofie do not move.
nb: Sonny og Sofie sitter fortsatt.

source: evaluate texts on the basis of own experiences and with an understanding of the language and content
nb: forklare noen likheter og forskjeller mellom muntlig og skriftlig språk, både nynorsk og bokmål

source: , can easily be perceived as rules for how adults should deal with children, and what should apply in different situations.
nb: , kan fort oppfattes som regler for hvordan voksne skal møte barn, og hva som skal gjelde i ulike situasjoner.

source: The programme subject covers the use of vegetation in different types of facilities, where emphasis is on areas of use and geographical and climatic conditions.
nb: Programfaget omfatter bruk av vegetasjon i ulike typer anlegg, der det legges vekt på bruksområde og geografiske og klimatiske forhold.

source: Oral skills are associated with Sign Language situations, speech situations and combinations thereof and involve listening actively and being able to speak, both spontaneously and after preparation.
nb: Å uttrykke seg muntlig innebærer å oppfatte, munnavlese, lytte og uttrykke seg forståelig og variert gjennom tale og/eller tegnspråk.

source: groups (students, parents/guardians, teachers and other employees) and how.
nb: (foresatte, ansatte og eventuelt andre) og på hvilken måte.

source: Several bonds are forged in the ecosystem.
nb: Flere bånd knyttes sammen i økosystemet.

source: communicate with good pronunciation and intonation
nb: dokumentere og vurdere egen utvikling i arbeid med utforsking av språket i bruk

source: students should therefore not have to request or demand such an adapted educational programme.
nb: Foresatte og elever skal derfor ikke behøve å etterspørre et slikt tilbud.

source: The programme subject covers the construction, mode of operation and operation of facilities, tools and equipment.
nb: Programfaget omfatter oppbygning, virkemåte og drift av anleggstyper, redskaper og utstyr.

source: The main subject area also emphasises the connections placed on the system of government, the state governed by law and human rights.
nb: I dette hovedområdet blir det også lagt vekt på sammenhenger mellom styreform, rettsstat og menneskerettigheter.

source: It also means being able to deal with budgets in connection with planning and operations.
nb: Det betyr også å kunne økonomi i tilknytning til planlegging og drift.

source: Even though a child’s age is decisive for expectations, pedagogical leaders are sceptical of accepting the age-related expectations specified on mapping forms.
nb: Selv om barnets alder er avgjørende for forventningene, er de pedagogiske lederne skeptiske til å godta aldersforventningene i kartleggingsskjemaene.

source: talk about Islam and how religious practice is expressed in maxims, rules of conduct, prayer, Koran readings, food traditions and holidays
nb: samtale om islam og hvordan religiøs praksis kommer til uttrykk gjennom leveregler, bønn, Koran-lesing, matregler og høytider

source: ‘Many believe that play is natural for all children.
nb: – Mange tenker at det å leke er naturlig for alle barn.

source: Existence and meaning
nb: Eksistens og mening

source: Being able to read covers the ability to locate information in different texts, learning subject matter and experiencing and understanding reasoning and assertions in a wide range of texts.
nb: Å kunne avlese omfatter både å kunne finne informasjon i ulike tekster, å lære fag og å oppleve og oppfatte resonnementer og framstillinger i et bredt spekter av tekstformer.

source: discuss the concepts of dialect, Bokmål and Nynorsk
nb: samtale om hvordan ord og bilde virker sammen i bildebøker og andre bildemedier

source: In Vg1 this main subject area is called
nb: I Vg1 er dette hovedområdet kalt

source: It also means being able to present one's own work clearly and comprehensibly to others, and being able to discuss one's own presentations as well as those of others.
nb: Det innebærer å kunne presentere resultater av eget arbeid tydelig og forståelig for andre, og å kunne samtale om egne og andres presentasjoner.

source: training candidates and certificate of practice candidates.
nb: Fordelingen skjer på grunnlag av hvor mye tid som har gått med i læretiden til opplæring.

source: plan and execute assignments in new installations in accordance with relevant regulations, standards, plans and specifications, and assess and document their own work
nb: planlegge og utføre oppgaver i nyanlegg etter gjeldende regelverk, standarder, planer og beskrivelser, vurdere og dokumentere eget arbeid

source: Statistics, probability and combinatorics
nb: Statistikk, sannsynlighet og kombinatorikk

source: Learning English may also give us better insight into our native language and other languages we know, thus becoming an important element in our personal development and making a significant contribution to our communicative abilities.
nb: Språklæringen skjer i møte med et mangfold av tekster, der tekstbegrepet brukes i vid forstand og omfatter talespråklige, tegnspråklige og skriftlige framstillinger i forskjellige kombinasjoner og i ulike tekster fra digitale medier.

source: transform trigonometric expressions of the type a sin kx + b cos kx, and use these to model periodic phenomena
nb: omforme trigonometriske uttrykk av typen a sin kx + b cos kx, og bruke dem til å modellere periodiske fenomener

source: describe and use the place-value system for whole numbers, use positive and negative whole numbers, simple fractions and decimal numbers in practical connections, and express number magnitudes in different ways
nb: beskrive og bruke plassverdisystemet for de hele tallene, bruke positive og negative hele tall, enkle brøker og desimaltall i praktiske sammenhenger og uttrykke tallstørrelser på varierte måter

source: listen to and talk about some stories of the apostles and saints
nb: lytte til og samtale om noen apostel- og helgenfortellinger

source: Initially published in 1998, the Swedish curriculum was strongly inspired by the philosophy of education and the practices of Reggio Emilia in northern Italy.
nb: Den svenske rammeplanen som kom i 1998, er sterkt inspirert av den pedagogiske filosofien og praksisen i Reggio Emilia nord i Italia.

source: Music is important in kindergarten.
nb: Musikk er viktig i barnehagen.

source: Documentation and quality
nb: Dokumentasjon og kvalitet

source: describe and use the place value system for decimal numerals, reckon with positive and negative whole numbers, decimals, fractions and percentages, and place these along a number line
nb: beskrive og bruke plassverdisystemet for desimaltall, regne med positive og negative hele tall, desimaltall, brøker og prosent og plassere de ulike størrelsene på tallinja

source: Understanding can be demonstrated by explaining, discussing alternatives, comparing relevant methods or assessing quality.
nb: Forståelse kan vises gjennom å forklare, drøfte ulike alternativer, sammenligne aktuelle metoder eller vurdere kvalitet.

source: participate in discussions with reasoned opinions and rational arguments
nb: uttrykke egne meninger på norsk eller tegnspråk i diskusjoner og vurdere hva som er saklig argumentasjon

source: experiment with speech sounds, words and expressions, rhymes and jingles
nb: eksperimentere med språklyder, ord og uttrykk, rim og regler

source: She and Alexander tuck all the children into their wool blankets.
nb: Hun og Alexander dekker over alle barna med ullpledd.

source: The teacher shall plan and facilitate for various ways for the pupils to demonstrate their competence, including through understanding, reflection and critical thinking, and in various contexts.
nb: Læreren skal planlegge og legge til rette for at elevene får vist kompetansen sin på varierte måter som inkluderer forståelse, refleksjon og kritisk tenkning, i ulike sammenhenger.

source: Ehrlin was especially interested in how staff views music.
nb: Ehrlin har vært spesielt interessert i hvordan personalet ser på musikk.

source: In a group of one-year-olds who have no verbal language skills, this offers a great way to communicate and make choices.
nb: I en samling med ettåringer som ikke har språk, er dette en fin måte å kommunisere på og ta valg på.

source: Familiarising oneself with different religions, philosophies of life, ethics and philosophies is an important precondition for understanding and interpreting our lives, and for gaining ethical awareness and understanding across religious faiths and cultural borders.
nb: Kjennskap til ulike religioner og livssyn, etikk og filosofi er en viktig forutsetning for livstolkning, etisk bevissthet og forståelse på tvers av tros- og livssynsgrenser.

source: Obviously, it was wrong, according to Johansson.
nb: Og det er det selvsagt også, mener Johansson.

source: Problem solving is a part of mathematical proficiency; it means analysing and transforming a problem into mathematical form, solving it and assessing its validity.
nb: Matematisk kompetanse innebærer å bruke problemløsning og modellering til å analysere og omforme et problem til matematisk form, løse det og vurdere gyldigheten av løsningen.
